/*Ось і завершилася Літня школа програмування та інформаційних технологій. Усі збираються
додому і виникло питання як найзручніше доставити усіх додому. Вирішили замовити автобус
на N пасажирів (кількість учнів та викладачів у школі) і рушили в путь. На під’їзді до Києва
з’ясувалося, що деяким пасажирам зручніше вийти раніше, не доїжджаючи до кінцевої зупинки.
Домовилися, що водій зробить рівно k зупинок. Макс помітив, що на кожній із зупинок із
автобуса виходило половина наявних пасажирів плюс півпасажира. Знаючи, що на останній
зупинці автобус став порожнім і ніхто не постраждав під час поїздки, він поставив собі за мету
визначити початкову кількість людей в автобусі. Допоможіть йому – напишіть програму, яка
виконує потрібні обчислення.*/


#include <iostream>
#include <bits/stdc++.h>
using namespace std;

int main()
{
    int N, num, at_start=1;
    cin >> N;
    for(int i=0; i<N; ++i)
    {
        cin >> num;
        at_start=(at_start << num)-1;
        cout << at_start << '\n';
        at_start=1;
    }
    
    return 0;
}