/*Щоб урізноманітнити дозвілля під час проведення Літньої
школи програмування та інформаційних технологій один з
викладачів цієї школи Андрій запропонував влаштувати
чемпіонат з настільних ігор. Вже пройшло кілька раундів і ось
перед початком чергової гри з’ясувалося, що загубилася одна
з карток! Що робити? Потрібно терміново з’ясувати, що це за
картка?
Всі картки мають номери від 1 до деякого натурального числа
N без пропусків. Напишіть програму, яка знаходить номер
втраченої картки.*/


#include <iostream>
#include <bits/stdc++.h>
using namespace std;

int main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(0);
    cout.tie(0);

    int N, num, missing;
    cin >> N;
    missing=N;
    for (int i = 1; i < N; i++)
    {
        cin >> num;
        missing = missing ^ num ^ i;
    }
    cout << missing << '\n';
    return 0;
}