/*Невгамовний кіт Матроскін вирішив серйозно зайнятися сільським господарством і зробив
фермерське хазяйство по розведенню корів. Все було просто чудово, поки телята не почали
хворіти. Як виявилося, їх уразив небезпечний вірус, який змінив генетичний код кожного
телятка. Генетичний код теляти являє собою деяке довільне двійкове число. Вірус змінив з
правого боку цього коду одиничні біти на нульові таким чином, щоб утворився неперервний
ланцюжок нульових бітів. Ланцюжок змінених бітів починався не обов’язково з самого краю
коду, але був неперервний. У кота Матроскіна є N уражених телят і їх потрібно терміново
вилікувати. Для цього необхідно визначити їх нові генетичні коди. Матроскіну відомі їх генетичні
коди до ураження. Допоможіть знайти нові генетичні коди телят для найшвидшого і якісного їх
лікування. Якщо новий генетичний код теляти виявиться нульовим, то такого телятка, на жаль,
вилікувати не можливо.*/


#include <iostream>
#include <bits/stdc++.h>
using namespace std;

int cow_code(int N, )
{
    int res=0, cnt=0, dig;
    dig = N & 1;
    while (dig!=1)
    {
        N = N >> 1;
        cnt++;
        dig = N & 1;
    }
    while (dig!=0)
    {
        N = N >> 1;
        cnt++;
        dig = N & 1;
    }
    res = N << cnt;
    return res;
}


int main()
{
    int N, num, cnt_doomed=0;
    cin >> N;
    for (int i = 0; i < N; i++)
    {
        cin >> num;
        if (cow_code(num)==0) cnt_doomed++;
        else cout << cow_code(num) << ' ';
        
    }
    cout << '\n'; 
    cout << cnt_doomed;
    return 0;
}
