/*Оленка прийшла провідати хворого Сашка і з захопленням почала йому розказувати, що на
уроках інформатики вони вчилися переводити числа із десяткової системи числення у двійкову
шляхом ділення числа націло на двійку. Маючи нестандартне мислення, Сашко одразу
винайшов інший алгоритм переведення і запропонував Оленці таку гру. Він називає будь-яке
натуральне десяткове число і вони (кожен своїм алгоритмом) швидко рахують, скільки одиниць
у двійковому представленні цього числа. Напишіть програму, яка допомагає перевірити
правильність відповіді гравців, тобто підраховує кількість одиниць у двійковому представленні
заданого десяткового числа.*/


#include <iostream>
#include <bits/stdc++.h>
using namespace std;

long long cnt_ones(long long N)
{
    long long cnt=0;
    while (N!=0)
    {
        cnt += N & 1;
        N = N >> 1;
    }
    
    return cnt;
}



int main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(0);
    cout.tie(0);

    long long N;
    cin >> N;
    
    cout << cnt_ones(N);
    return 0;
}