/*Під час виконання домашнього завдання з геометрії Петрику
знадобилося намалювати прямокутник таким чином, щоб його
сторони були паралельні осям координат. Він вже вибрав на
площині три точки з чотирьох потрібних для побудови і
впевнений, що вибрав їх вірно. Залишилося вибрати ще одну.
Допоможіть Петрику знайти координати цієї точки*/


#include <iostream>
#include <bits/stdc++.h>
using namespace std;

int main()
{
    int x1, y1, x2, y2, x3, y3, x4, y4;
    cin >> x1 >> y1 >> x2 >> y2 >> x3 >> y3;
    
    x4=x1^x2^x3;
    y4=y1^y2^y3;
    cout << x4 << " " << y4 << '\n';
    return 0;
}